Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/guide/middleware.po
Languages: es_ve, tr_tr

source: Middlewares
tr_tr: Özel yazılımlar

source: Middlewares works in between the master channel and slave channels, they look through messages and statuses delivered between channels, passing them on, make changes or discarding them, one after another.
es_ve: Los middlewares trabajan entre los canales maestros y los canales esclavos. Ellos examinan los mensajes y estados enviados entre cada canal, los pasan entre ellos, les hacen cambios o los descartan.
tr_tr: Özel yazılımlar ana kanal ve bağımlı kanallar arasında çalışır, kanallar arasında iletilmiş mesajları ve durumları sıra sıra gözden geçirirler, devam etmelerini sağlarlar, değişiklikler yaparlar veya devre dışı bırakırlar.

source: Like channels, middlewares will also each have an instance per EFB session, managed by the coordinator. However, they don't have centrally polling threads, which means if a middleware wants to have a polling thread or something similar running in the background, it has to stop the thread using Python's ``atexit`` or otherwise.
es_ve: Como los canales, los middlewares también tienen una instancia por cada sesión EFB. administrada por el coordinador. Sin embargo, ellos no tienen threads de sondeo centrales, lo que significa que si un middleware necesita tener un thread de sondeo o algo similar corriendo en segundo plano, tendrá que detener el thread usando ``atexit`` en Python.
tr_tr: Kanallarda olduğu gibi, orta sınıfların da EFB oturumu başına koordinatör tarafından yönetilen bir örneği olacaktır. Bununla birlikte, merkezi sorgulama mesaj dizisine sahip değillerdir, yani, bir ara katman yazılımı, bir sorgulama mesaj dizisi ya da arka planda benzer bir şey çalıştırmak istiyor ise, mesaj dizisi Python'un ``atexit``i kullanarak veya başka bir şekilde durdurmak zorunda kaldıkları anlamına gelir.

source: Message and Status Processing
es_ve: Procesando el mensaje y el estado
tr_tr: Mesaj ve Durum İşleme

source: Each middleware by default has 2 methods, :meth:`~.ehforwarderbot.EFBMiddleware.process_message` which processes message objects, and :meth:`~.ehforwarderbot.EFBMiddleware.process_status` which processes status objects. If they are not overridden, they will not touch on the object and pass it on as is.
es_ve: Cada middleware tienen 2 métodos de manera predeterminada, :meth:`~.ehforwarderbot.EFBMiddleware.process_message` el cual procesa los objetos mensajes y :meth:`~.ehforwarderbot.EFBMiddleware.process_status` el cual procesa los objetos estado. Si ellos no son anulados , no tocarán el objeto y se pasarán exactamente como se encuentran.
tr_tr: Varsayılan olarak her ara katman yazılımı, 2 yöntem içerir, mesaj nesnelerini işleyen :meth: `~.ehforwarderbot.EFBMiddleware.process_message` ve durum nesnelerini işleyen :meth: `~ .ehforwarderbot.EFBMiddleware.process_status`. Geçersiz kılınmazlarsa, nesneye dokunmaz ve olduğu gibi yayarlar.

source: To modify an object, just override the relative method and make changes to it. To discard an object, simply return ``None``. When an object is discarded, it will not be passed further to other middlewares or channels, which means a middleware or a channel should never receive a ``None`` message or status.
es_ve: Para modificar un objeto, solo sobreescribe un método relativo y haz cambios en él. Para descartar un objeto, simplemente haz que retorne ``None``. Cuando un objeto es descartado, no será enviado a otros middlewares o canales, lo que quiere decir que un middleware o canal nunca debe recibir un mensaje o estado ``None``.
tr_tr: Bir nesneyi değiştirmek için, yalnızca ilgili yöntemi geçersiz kılın ve değişiklik yapın. Bir nesneyi atmak için, sadece `` Hiçbiri``ne geri dönün. Bir nesne atıldığında, başka orta sınıflara veya kanallara daha fazla geçirilmeyecektir; bu, bir ara katmanın veya bir kanalın hiçbir zaman "Hiçbiri" mesajı veya statüsü almaması gerektiği anlamına gelir.

source: Other Usages
es_ve: Otros usos
tr_tr: Diğer Kullanımlar

source: Having rather few limitation compare to channels, middlewares are rather easy to write, which allows it to do more than just intercept messages and statuses.
es_ve: Teniendo un poco más limitaciones en comparación con los canales, los middlewares son más fáciles de escribir, lo que les permite hacer más que simplemente interceptar los mensajes y estados.
tr_tr: Kanallara kıyasla birkaç kısıtlamaya sahip olup, mesaj ve durumların sadece kesişmesini sağlamaktan daha çok şey yapmaya izin veren özel yazılımları yazmak nispeten daha kolaydır.

source: Some ideas:
es_ve: Algunas ideas:
tr_tr: Bazı fikirler:

source: Periodic broadcast to master / slave channels
es_ve: Emisión periódica a los canales maestros y esclavos
tr_tr: Ana / bağımlı kanallarına periyodik yayın

source: Integration with chat bots
es_ve: Integración a los bots de chats
tr_tr: Sohbet botları ile entegrasyon

source: Automated operations on vendor-specific commands / additional features
es_ve: Operaciones automáticas en los comandos específicos de vendedor o en las funciones adicionales
tr_tr: Satıcıya özel komutlarla ilgili otomatik işlemler / Ek özellikler

source: Share user session from slave channel with other programs
es_ve: Comparte información de la sesión de usuario desde un canal esclavo a otros programas
tr_tr: Bağımlı kanallardan kullanıcı oturumlarını diğer programlarla paylaşma

source: etc...
tr_tr: vb...
