Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/guide/packaging.po
Languages: es_ve, tr_tr

source: Packaging and Publish
es_ve: Empaque y Publicación
tr_tr: Derleme ve Yayınlama

source: Publish your module on PyPI
es_ve: Publica tu módulo en PyPI
tr_tr: Modülünüzü PyPl üzerinden yayınlayın

source: Publish modules on PyPI is one of the easiest way for users to install your package. Please refer to related documentation and tutorials about PyPI and pip for publishing packages.
es_ve: Publicar módulos en PyPI es una de las maneras más sencillas para que los usuarios instalen su paquete. Consulte la documentación relacionada y tutoriales sobre PyPI y pip para publicar paquetes.
tr_tr: Kullanıcıların paketinizi yüklemelerinin en kolay yollarından biri, PyPI'de modülleri yayınlamaktır. Lütfen PyPI hakkında ilgili dokümanlara ve öğreticilere ve paketleri yayınlamak için pip'e bakınız.

source: For EFB modules, the package is recommended to have a name starts with ``efb-``, or in the format of ``efb-platform-type``, e.g. ``efb-irc-slave`` or ``efb-wechat-mp-filter-middleware``. If there is a collision of name, you can adjust the package name accordingly, but please start the package name with ``efb-``.
es_ve: Para los módulos de EFB, se recomienda que el paquete tenga un nombre que empiece por `` efb-``, o en el formato de `` efb-platform-type``, p. `` efb-irc-slave`` o `` efb-wechat-mp-filter-middleware``. Si hay una colisión de nombre, puede ajustar el nombre del paquete en consecuencia, pero empiece el nombre del paquete con `` efb-``.
tr_tr: EFB modülleri için paketin ``efb-`` ile başlayan veya ``efb-platform-type`` gibi bir formatta olması önerilir; örn. `` efb-irc-slave`` veya `` efb-wechat-mp-filter-middleware``. Bir isim çarpışması varsa, buna göre paket adını ayarlayabilirsiniz, ancak lütfen paket adını ``efb-`` ile başlatın.

source: Module discovery
es_ve: Descubrimiento de módulo
tr_tr: Modül keşfi

source: EH Forwarder Bot uses `Setuptools' Entry Point feature`__ to discover and manage channels and middlewares. In your ``setup.py`` script or ``.egg-info/entry_points.txt``, specify the group and object as follows:
es_ve: EH Forwarder Bot utiliza la función de punto de entrada`Setuptools` __ para descubrir y administrar canales y middlewares. En su escritura `` setup.py`` o ``.egg-info / entry_points.txt``, especifique el grupo y el objeto de la siguiente manera:
tr_tr: EH Forwarder Bot, kanalları ve orta sayfaları keşfetmek ve yönetmek için `Setuptools' Entry Point feature` _ kullanır. ``setup.py`` komut dosyanıza veya ``.egg-info/entry_points.txt`` dizininde, grubu ve nesneyi aşağıdaki gibi belirtin:

source: Group for master channels: ``ehforwarderbot.master``
es_ve: Grupo para canales maestros: `` ehforwarderbot.master``
tr_tr: Ana kanallar için grup: ``ehforwarderbot.master``

source: Group for slave channels: ``ehforwarderbot.slave``
es_ve: Grupo para canales esclavos: `` ehforwarderbot.slave``
tr_tr: Bağımlı kanallar için grup: ``ehforwarderbot.slave``

source: Group for middlewares: ``ehforwarderbot.middleware``
tr_tr: Middlewares için grup: ``ehforwarderbot.middleware``

source: Convention for object names is ``<author>.<platform>``, e.g. ``alice.irc``. This should also be your module's ID.
es_ve: La convención para nombres de objetos es `` <author>.<platform>``, p. Ej. `` alice.irc``. Esta también debería ser la identificación de su módulo.
tr_tr: Nesne adları için kural ``<author>.<platform>``, örneğin ``alice.irc``. Bu da modülünüzün kimliği olmalıdır.

source: Object reference should point to your module's class, which extends either ``EFBChannel`` or ``EFBMiddleware``.
es_ve: La referencia de objeto debe apuntar a la clase de su módulo, que se extiende ya sea ``EFBChannel`` o `` EFBMiddleware``.
tr_tr: Nesne referansı, ``EFBChannel`` veya ``EFBMiddleware`` uzanan modülünüzün sınıfa işaret etmelidir.

source: Example
es_ve: Ejemplo
tr_tr: Örnek

source: ``setup.py`` script
tr_tr: ``setup.py`` komut dosyası

source: Private modules
es_ve: Módulos privados
tr_tr: Özel modüller

source: If you want to extend from, or make changes on existing modules for your own use, you can have your modules in the private modules :doc:`directory <../directories>`.
es_ve: Si desea extender o hacer cambios en los módulos existentes para su propio uso, puede tener sus módulos en los módulos privados: :doc: `directorio <../ directories>`.
tr_tr: Kendi kullanımınız için mevcut modüllerden uzatmak ya da değişiklikler yapmak isterseniz, modüllerinizi özel modüllere yerleştirebilirsiniz :doc:`directory <../directories>`.

source: For such modules, your channel ID must be the fully-qualifying name of the class. For example, if your class is located at ``<EFB_BASE_PATH>/modules/bob_irc_mod/__init__.py:IRCChannel``, the channel must have ID ``bob_ric_mod.IRCChannel`` for the framework to recognise it.
es_ve: Para dichos módulos, su ID de canal debe ser el nombre completo de la clase. Por ejemplo, si su clase está ubicada en `` <EFB_BASE_PATH> / modules / bob_irc_mod / __init__. Py: IRCChannel``, el canal debe tener ID `` bob_ric_mod.IRCChannel`` para que el sistema lo reconozca.
tr_tr: Bu tür modüller için, kanal kimliğiniz sınıfın tam nitelikli adı olmalıdır. Örneğin, sınıfınız: ``<EFB_BASE_PATH>/modules/bob_irc_mod/__init__.py:IRCChannel``, Sistemin tanıması için kanalın kimliği ``bob_ric_mod.IRCChannel`` olmalıdır.
