Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/guide/storage.po
Languages: es_ve, id_id

source: Configurations and storage
es_ve: Configuraciones y almacenamiento
id_id: Konfigurasi dan penyimpanan

source: Configurations and Permanent Storage
es_ve: Configuraciones y almacenamiento permanente
id_id: Konfigurasi dan Penyimpanan Permanen

source: As described in :doc:`/directories`, each module has been allocated with a folder per profile for configurations and other storage. The path can be obtained using :meth:`~.ehforwarderbot.utils.get_data_path` with your module ID. All such storage is specific to only one profile.
es_ve: Como se describe en :doc: `/ directories`, cada módulo ha sido asignado con una carpeta por perfil para configuraciones y otro almacenamiento. La ruta se puede obtener usando :meth:`~.ehforwarderbot.utils.get_data_path` con su ID de módulo. Todo ese almacenamiento es específico para un solo perfil.
id_id: Seperti dijelaskan di: doc: `/ directories`, setiap modul telah dialokasikan dengan folder per profil untuk konfigurasi dan penyimpanan lainnya. Jalan dapat diperoleh dengan menggunakan: meth: `~ .ehforwarderbot.utils.get_data_path` dengan ID modul Anda. Semua penyimpanan seperti itu khusus hanya untuk satu profil.

source: For configurations, we recommend to use ``<module_data_path>/config.yaml``. Similarly, we prepared :meth:`~.ehforwarderbot.utils.get_config_path` to get the path for default config file. Again, you are not forced to use this name or YAML as the format of your config file.
es_ve: Para configuraciones, recomendamos usar``<module_data_path>/config.yaml`` . De forma similar, preparamos :meth:`~.ehforwarderbot.utils.get_config_path`para obtener la ruta del archivo de configuración predeterminado. Nuevamente, no está obligado a usar este nombre o YAML como el formato de su archivo de configuración.
id_id: Untuk konfigurasi, kami sarankan untuk menggunakan `` <module_data_path> / config.yaml``. Demikian pula, kami menyiapkan :meth: `~ .ehforwarderbot.utils.get_config_path` untuk mendapatkan path untuk file konfigurasi default. Sekali lagi, Anda tidak dipaksa untuk menggunakan nama ini atau YAML sebagai format file konfigurasi Anda.

source: Usually in the storage folder lives:
es_ve: Por lo general, en la carpeta de almacenamiento existen:
id_id: Biasanya di folder penyimpanan tinggal:

source: Configuration files
es_ve: Archivos de configuración
id_id: File konfigurasi

source: User credentials / Session storage
es_ve: Credenciales de usuario / Almacenamiento de sesión
id_id: Kredensial pengguna / penyimpanan sesi

source: Databases
es_ve: Base de datos
id_id: Database

source: Temporary Storage
es_ve: Almacenamiento temporal
id_id: Penyimpanan Sementara

source: While processing multimedia messages, we inevitably need to store certain files temporarily, either within the channel or across channels. Usually, temporary files can be handled with Python's ``tempfile`` library.
es_ve: Al procesar mensajes multimedia, inevitablemente necesitamos almacenar ciertos archivos temporalmente, ya sea dentro del canal o entre canales. Por lo general, los archivos temporales se pueden manejar con la biblioteca `` tempfile`` de Python.
id_id: Saat memproses pesan multimedia, kita pasti perlu menyimpan file tertentu untuk sementara, baik di dalam saluran maupun di saluran. Biasanya, file sementara bisa ditangani dengan perpustakaan `tempfile` Python.
