Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/guide/walkthrough.po
Languages: tr_tr

source: Walk-through — How EFB works
tr_tr: Walk-through — EFB nasıl çalışır?

source: EH Forwarder Bot is an extensible framework that allows user to control and manage accounts from different chat platforms in a unified interface. It consists of 4 parts: a Master Channel, some Slave Channels, some Middlewares and a Coordinator.
tr_tr: EH Forwarder Bot, kullanıcıların farklı sohbet platformlarındaki hesaplarını birleştirilmiş bir arayüzde kontrol etmesine ve yönetmesine olanak tanıyan genişletilebilir bir çerçevedir. 4 bölümden oluşur: Ana Kanal, bazı Bağımlı Kanalları, bazı Ara Katman Yazılımları ve bir Koordinatör.

source: Master Channel
tr_tr: Ana Kanal

source: The channel that directly interact with the user. There is guaranteed to have one and only one master channel in an EFB Session.
tr_tr: Kullanıcıyla doğrudan etkileşim kuran kanal. Bir EFB Oturumu'nda bir ve sadece bir ana kanal olması garantilidir.

source: Slave Channel
tr_tr: Bağımlı Kanal

source: The channel that delivers messages to and from their relative platform. There should be at lease one slave channel in an EFB Session.
tr_tr: Göreceli platforma mesaj gönderen kanal. EFB Oturumu'nda kira bir slave kanalı olmalıdır.

source: Coordinator
tr_tr: Koordinatör

source: Component of the framework that maintains the instances of channels, and delivers messages between channels.
tr_tr: Kanal örneklerini koruyan ve kanallar arasında mesajlar gönderen bir yapı bileşeni.

source: Middleware
tr_tr: Özel yazılım

source: Module that processes messages and statuses delivered between channels, and make modifications where needed.
tr_tr: Kanallar arasında iletilen mesajları ve durumları işleyen ve gerektiğinde değişiklikler yapan modül.

source: Concepts to know
tr_tr: Bilinecek kavramlar

source: Module
tr_tr: Modül

source: A common term that means both channels and middlewares.
tr_tr: Hem özel yazılım, hem kanal anlamına gelen ortak terim.

source: Chat
tr_tr: Sohbet

source: A place where conversations happen. Consists of User Chats (private messages), Group Chats, and System Chats.
tr_tr: Sohbetlerin gerçekleştiği bir yer. Kullanıcı Sohbetlerini (özel mesajlar), Grup Sohbetlerini ve Sistem Sohbetlerini içerir.

source: User / User Chat
tr_tr: Kullanıcı / Kullanıcı Sohbeti

source: A user of the IM platform that the user can possibly chat with, or a conversation with them. Messages from such conversation has one and only one unique author. *(Except messages that are from the user themself, or from the system.)*
tr_tr: Kullanıcının muhtemelen sohbet edebileceği bir IM platformu kullanıcısı veya onlarla bir karşılıklı konuşma. Bu konuşmalardan gelen mesajların yalnızca bir ve tek bir yazarı vardır. *(Kullanıcının kendisinden veya sistemden gelen mesajlar hariç)*

source: For platforms that support bot or something similar, they would also be considered as a "user", unless messages in such chat can be sent from any user other than the bot.
tr_tr: Botu destekleyen veya benzer bir şeyleri destekleyen platformlar için, böyle bir sohbetteki mesajlar bot dışındaki herhangi bir kullanıcıdan gönderilemediği sürece "kullanıcı" olarak da düşünülür.

source: For chats that the user receive messages, but cannot send message to, it should also be considered as a user chat, only to raise an exception when messages was trying to send to the chat.
tr_tr: Kullanıcının mesaj aldığı, ancak mesaj gönderemediği sohbetler için bir kullanıcı sohbeti olarak da düşünülmeli, sadece mesajlar sohbet'e gönderilmeye çalışıldığında bir istisna getirilmelidir.

source: Group chat
tr_tr: Grup sohbeti

source: A chat that involves more than one user. A group chat should have a list of members (users) that can involve in the conversation.
tr_tr: Birden fazla kullanıcıyı kapsayan bir sohbet. Bir grup sohbeti, konuşmaya dahil olabilecek üyelerin (kullanıcıların) listesini içermelidir.

source: System chat
tr_tr: Sistem sohbeti

source: A chat that is a part of the system. Usually used for chats that are either a part of the IM platform, or the channel. Slave channels can use this feature to send system message and notifications to the master channel.
tr_tr: Sistemin bir parçası olan bir sohbet. Genellikle IM platformunun bir parçası olan sohbetler veya kanal için kullanılır. Bağımlı kanallar, ana kanala sistem mesajı ve bildirimler göndermek için bu özelliği kullanabilir.

source: Message
tr_tr: İleti

source: Messages are delivered strictly between the master channel and a slave channel. It usually carries an information of a certain type.
tr_tr: Mesajlar tam olarak ana kanal ve bağımlı kanallar arasında iletilmektedir. Genellikle belirli bir türde bilgi taşırlar.

source: Each message should at least have a unique ID that is distinct within the slave channel related to it. Any edited message should be able to be identified with the same unique ID.
tr_tr: Her mesajın, en azından bağımlı kanala ait kendine özgü benzersiz bir kimliği olması gerekir. Düzenlenen herhangi bir mesaj aynı benzersiz kimlikle tanımlanabilmelidir.

source: Status
tr_tr: Durum

source: Information that is not formatted into a message. Usually includes updates of chats and members of chats, and removal of messages.
tr_tr: Bir mesaj biçimlendirilmemiş bilgi. Genellikle, sohbetlerin ve sohbet üyelerinin güncellenmesini ve mesajların kaldırılmasını içerir.

source: Slave Channels
tr_tr: Bağımlı Kanallar

source: The job of slave channels is relatively simple.
tr_tr: Bağımlı kanal işi nispeten basittir.

source: Master Channels
tr_tr: Ana Kanallar

source: The job of the master channel includes:
tr_tr: Ana kanal işi şunları içerir:

source: Offer an interface for the user to use "extra functions" from slave channels.
tr_tr: Bagımlı kanallardan "ekstra işlevler" kullanması için kullanıcı arabirimi sunun.

source: Process updates from slave channels.
tr_tr: Bağımlı kanallardaki güncellemeleri işle.

source: Provide a user-friendly interface as far as possible.
tr_tr: Mümkün olduğunda kullanıcı-dostu bir arayüz sağla.

source: Middlewares
tr_tr: Özel yazılımlar
