Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/getting-started.po
Languages: es_ve, tr_tr

source: Getting started
es_ve: Comenzando
tr_tr: Başlarken

source: A few simple steps to get started with EFB.
es_ve: Unos pasos sencillos para empezar a utilizar la plataforma EFB.
tr_tr: Başlamadan önce EFB ile ilgili birkaç basit adım.

source: Install EH Forwarder Bot
es_ve: Instala el EH Forwarder Bot
tr_tr: EH Forwarder Bot Yükle

source: EH Forwarder Bot can be installed in the following ways:
es_ve: EH Forwarder Bot puede ser instalado de las siguientes maneras:
tr_tr: EH Forwarder Bot aşağıdaki yollarla yüklenebilir:

source: The following instructions may not work properly until a stable release is uploaded. As you are in the beta version documentation, I assume you know what to do.
es_ve: Las siguientes instrucciones podrían funcionar incorrectamente hasta que se libere una versión más estable. Como te encuentras en la documentación beta, asumo que sabes que hay que hacer.
tr_tr: Aşağıdaki yönergeler, kararlı bir sürüm yüklenene kadar düzgün çalışmayabilir. Beta sürüm dökümanlarında olduğu gibi, ne yapacağınızı bildiğinizi varsayıyorum.

source: Install from PyPI
es_ve: Instala desde PyPI
tr_tr: PyPl'den yükle

source: ``pip`` will by default install the latest stable version from PyPI, but development versions are available at PyPI as well.
es_ve: Por defecto ``pip`` instala la última versión disponible de PyPI, pero las versiones en desarrollo también están disponibles en PyPI.
tr_tr: `` pip``, varsayılan olarak PyPI'den en son kararlı sürümü kuracaktır, ancak PyPI'de geliştirme sürümleri de mevcuttur.

source: Install from GitHub
es_ve: Instalación desde GitHub
tr_tr: GitHub'dan yükle

source: This will install the latest commit from GitHub. It might not be stable, so proceed with caution.
es_ve: Esto instalará el último commit disponible en GitHub. Podría no ser estable, así que procede con precaución.
tr_tr: Bu, GitHub'dan en günceli yükleme yapacaktır. Kalıcı olmayabilir, bu yüzden dikkatlice ilerleyin.

source: A good network environment
es_ve: Un buen entorno de red
tr_tr: İyi bir bağlantı ortamı

source: Create local directories
es_ve: Crea directorios locales
tr_tr: Yerel dizinleri oluştur

source: EFB uses a \*nix user configuration style, which is described in details in :doc:`directories`. In short, if you are using the default configuration, you need to create ``~/.ehforwarderbot``, and give read and write permission to the user running EFB.
es_ve: EFB utiliza un estilo de configuración de usuario \*nix descrito en detalle en :doc:`directories`. En resumen, si estas utilizando la configuración por defecto, necesitas crear ``~/.ehforwarderbot``, y proporcionar permisos de lectura y escritura al usuario que esta ejecutando EFB.
tr_tr: EFB, \*nix kullanıcı yapılandırma stilini kullanır; bu stil ayrıntılı olarak :doc:`dizinler` bölümünde açıklanmıştır. Kısaca, varsayılan yapılandırmayı kullanıyorsanız, ``~/.ehforwarderbot`` oluşturmanız ve EFB'yi çalıştıran kullanıcıya okuma ve yazma izni vermeniz gerekir.

source: Choose, install and enable modules
es_ve: Elige, instala y habilita los módulos
tr_tr: Modülleri seç, yükle ve etkinleştir

source: Currently, all modules that was submitted to us are recorded in the `channels repository <https://github.com/blueset/ehForwarderBot/wiki/Channels-Repository>`_. You can choose the channels that fits your need the best.
es_ve: Actualmente todos lo módulos disponibles se encuentran en "el repositorio de canales" en <https://github.com/blueset/ehForwarderBot/wiki/Channels-Repository>`_. Allí puedes elegir con los canales que mejor cumplan con tus necesidades.
tr_tr: Şu anda bize gönderilen tüm modüller `kanal deposu <https://github.com/blueset/ehForwarderBot/wiki/Channels-Repository> ' olarak kaydediliyor. İhtiyacınıza en uygun kanalları seçebilirsiniz.

source: Instructions about installing each channel is available at their respective documentations.
es_ve: Las instrucciones acerca de como instalar cada canal están disponibles en su documentación respectiva.
tr_tr: Her kanalın yüklenmesine ilişkin talimatlar kendi belgelerinde mevcuttur.

source: When you have successfully installed a channel, you can enable it by listing its Channel ID in the configuration file. The default path is ``~/.ehforwarderbot/profiles/default/config.yaml``. Please refer to :doc:`directories` if you have configured otherwise.
es_ve: Cuando hayas instalado correctamente un canal, puedes habilitarlo listando su ID de canal en el archivo de configuración. La ruta predeterminada del archivo es ``~/.ehforwarderbot/profiles/default/config.yaml``. Por favor revisa :doc:`directories` si lo has configurado distinto.
tr_tr: Bir kanalı başarıyla yüklediğiniz zaman, kanal kimliğini yapılandırma dosyasında listeleyerek etkinleştirebilirsiniz. Varsayılan yol ``~/.ehforwarderbot/profiles/default/config.yaml``. Aksi halde yapılandırdıysanız lütfen :doc:`dizinler'e bakın.

source: Please note that although you can have more than one slaves channels running at the same time, you can only have exactly one master channels running in one profile. Meanwhile, middlewares are completely optional.
es_ve: Nota por favor que a pesar de que puedes tener más de un canal esclavo ejecutándose al mismo tiempo, solo puedes tener un canal maestro en un perfil. Mientras que los middlewares son completamente opcionales.
tr_tr: Aynı zamanda çalışan birden fazla bağımlı kanalınız olduğu halde, tek bir profilde çalışan tek bir ana kanalınız olabilir. Bu arada, orta sınıflar tamamen isteğe bağlıdır.

source: Syntax
es_ve: Sintaxis
tr_tr: Sözdizimi

source: The configuration file is in the YAML syntax. If you are not familiar with its syntax, please check its documentations and tutorials for details.
es_ve: La configuración del archivo esta en la sintaxis YAML. Si no estas familiarizado con ella, por favor revisa su documentación y sus tutoriales para más detalles.
tr_tr: Yapılandırma dosyası YAML içindeki sözdiziminde. Eğer onun sözdizimine aşina değilsen, detayları için onun belgeleri ve öğreticilerini kontrol edin.

source: The ID of the master channel enabled is under the key ``master_channel``
es_ve: El ID del canal maestro habilitado usa la llave ``master_channel`` para acceder a él
tr_tr: Etkinleştirilmiş ana kanalın kimliği ``ana_kanal`` tuşunun altındadır

source: The ID of slave channels enabled is listed under the key ``slave_channel``. It has to be a list even if just one channel is to be enabled.
es_ve: La lista de los ID esclavos habilitados usa la llave ``slave_channel`` para acceder a ella. Tiene que ser una lista incluso si solo un canal esclavo esta habilitado.
tr_tr: Etkinleşmiş bağımlı kanalların kimliği ``bağımlı_kanal``tuşunun altında listelenmiştir. Eğer sadece bir kanal etkinleştirilecek olsa bile o bir liste olmalıdır.

source: The ID of middlewares enabled are listed under the key ``middlewares``. It has to be a list even if just one middleware is to be enabled. However, if you don't want to enable any middleware, just omit the section completely.
es_ve: Los ID de middlewares habilitados usan la llave ``middlewares`` para acceder a ellos. Debe ser una lista incluso si solo existe un middleware habilitado. Sin embargo, si no quieres habilitar ningún middleware, omite esta sección completamente.
tr_tr: Etkinleştirilmiş özel yazılımların kimliği ``özel yazılımlar`` tuşunun altında listelenmiştir. Eğer sadece bir özel yazılım etkinleştirilecek olsa bile o bir liste olmalıdır. Bununla birlikte, eğer herhangi bir özel yazılımı etkinleştirmek istemiyorsanız, sadece bölümü tamamen atlayın.

source: To have multiple accounts running simultaneously, you can also appoint an instance ID to a module. Instance ID can be defined by the user, and if defined, it must has nothing other than letters, numbers and underscores, i.e. in regular expressions ``[a-zA-Z0-9_]+``. When an instance ID is not defined, the channel will run in the "default" instance with no instance ID.
es_ve: Para que múltiples cuentas se ejecuten simultáneamente, puedes designar un ID de una instancia a un módulo. Los ID de instancia pueden ser definidos por los usuarios y si son definidos, solo puede contener letras, números y guiones bajos, por ejemplo: expresiones regulares (regex) ``[a-zA-Z0-9_]+``. Cuando la instancia de un ID no esta definida, el canal se ejecutará en la instancia "predeterminada" sin ningún ID de instancia.
tr_tr: Aynı anda birden fazla hesap çalıştırmak için bir modüle bir örnek kimliğini de atayabilirsiniz. Örnek Kimliği kullanıcı tarafından tanımlanabilir ve tanımlandıysa, harfler, rakamlar ve altçizgilerden başka bir şey olmamalıdır, yani normal ifadelerde ``[a-zA-Z0-9_]+`` şeklinde olmalıdır. Bir örnek kimliği tanımlanmadığında, kanal örnek kimliğine sahip olmayan "varsayılan" örneğinde çalışır.

source: To indicate the instance ID of an instance, append ``#`` following by the instance ID to the module ID. For example, slave channel ``bar.dummy`` running with instance ID ``alice`` should be defined as ``bar.dummy#alice``. If the channel requires configurations, it should be done in the directory with the same name (e.g. ``EFB_DATA_PATH/profiles/PROFILE/bar.dummy#alice``), so as to isolate instances.
es_ve: Para indicar el ID de una instancia, anexa ``#`` seguido de el ID de instancia del módulo. Por ejemplo, un canal esclavo ``bar.dummy`` ejecutandose con un ID de instancia `alice`` debe definirse como ``bar.dummy#alice``. Si el canal requiere de configuraciones, debe ser realizado en un directorio con el mismo nombre (ejemplo: ``EFB_DATA_PATH/profiles/PROFILE/bar.dummy#alice``), para así aislar las instancias.
tr_tr: Bir örneğin örnek kimliğini belirtmek için, modül kimliğine örnek kimliğiyle birlikte gelen `` # `` e ekleyin. Örneğin, ``alice`` isimli örnek kimliğiyle çalışan ``bar.dummy`` başlangıç kanalı ``bar.dummy#alice`` olarak tanımlanmalıdır. Kanal yapılandırmalar gerektiriyorsa, örnekleri birbirinden ayırmak için aynı ada sahip dizinde (örneğin, ``EFB_DATA_PATH/profiles/PROFILE/bar.dummy#alice``) yapılmalıdır.

source: Please avoid having two modules with the same set of module ID and instance ID as it may leads to unexpected results.
es_ve: Por favor evita tener dos módulos con el mismo conjunto de ID de módulo y ID de instancia, dado que esto puede traer resultados inesperados.
tr_tr: Beklenmedik sonuçlara yol açabileceğinden lütfen aynı modül kimliğine ve örnek kimliğine sahip iki modüle sahip olmaktan kaçının.

source: Example
es_ve: Ejemplo
tr_tr: Örnek

source: Master channel
es_ve: Canal maestro
tr_tr: Ana Kanal

source: Slave channels
es_ve: Canales esclavos
tr_tr: Bağımlı kanallar

source: Dummy Slave (``bar.dummy``) at ``alt`` instance
es_ve: Dummy Slave (``bar.dummy``) en la instancia ``alt``
tr_tr: `` Alt`` örneğinde kukla slave (`` bar.dummy``)

source: Middlewares
tr_tr: Özel yazılımlar

source: In the ``config.yaml`` it should have the following lines:
es_ve: El archivo ``config.yaml``, debería contar con las siguientes líneas:
tr_tr: ``config.yaml`` dosyasında şu satırlar olmalıdır:

source: Launch EFB
tr_tr: EFB'yi çalıştır

source: This will launch EFB directly in the current environment. The default :doc:`profile` is named ``default``, to launch EFB in a different profile, append ``--profile <profile-name>`` to the command.
es_ve: Esto ejecutará EFB directamente en el entorno actual. El :doc:`profile` predeterminado es llamado ``default``. Si quieres ejecutar EFB en un perfil diferente, añade ``--profile <profile-name>`` al comando.
tr_tr: Bu, doğrudan geçerli ortamda EFB'yi başlatacaktır. Varsayılan :doc:`profile` den farklı bir profile EFB'yi başlatmak için ``default`` olarak isimlendirilir ve komuta``--profile <profile-name>`` eklenir.

source: For more command line options, use ``--help`` option.
es_ve: Para más opciones de línea de comandos usa la opción ``--help``.
tr_tr: Daha fazla komut satırı seçeneği için, ``--help`` seçeneğini kullanın.

source: Launch EFB as a daemon process
es_ve: Lanza EFB como un proceso Daemon
tr_tr: EFB'yi bir daemon işlemi olarak başlat

source: Since version 2, EH Forwarder Bot has removed the daemon helper as it is unstable to use. We recommend you to use mature solutions for daemon management, such as systemd_, upstart_, or pm2_.
es_ve: Desde la versión 2, EH Forwarder Bot removió el helper del daemon debido a que es inestable su uso. Recomendamos usar una solución más robusta para el manejo del daemon tales como systemd_, upstart_ o pm2_.
tr_tr: Versiyon 2'den bu yana, EH Forwarder Bot daemonun yardımcısını kullanmakta kararsız olduğu için kaldırıldı. Daemon yönetimi için, systemd_, upstart_ yada pm2_ gibi kararlı çözümler kullanmanızı öneririz.
