Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/API/message.po
Languages: tr_tr

source: A message.
tr_tr: Bir mesaj.

source: Optional[:obj:`.EFBMsgAttribute`] -- Attributes used for a specific message type. Only specific message type requires this attribute. Defaulted to ``None``.
tr_tr: Optional[:obj:`.EFBMsgAttribute`] -- Özel bir ileti türü için kullanılan öznitelikler. Bu öznitelikler yalnızca özel ileti türünü gerektirir. Varsayılan olarak `` None``.

source: Link: :obj:`.EFBMsgLinkAttribute`
tr_tr: Bağlantı: :obj:`.EFBMsgLinkAttribute`

source: Location: :obj:`.EFBMsgLocationAttribute`
tr_tr: Konum: :obj:`.EFBMsgLocationAttribute`

source: Status: Typing/Sending files/etc.: :obj:`.EFBMsgStatusAttribute`
tr_tr: Durum: Typing/Sending files/etc.: :obj:`.EFBMsgStatusAttribute`

source: :obj:`.EFBChat` -- Author of this message.
tr_tr: :obj:`.EFBChat` -- Mesajın sahibi.

source: Optional[:obj:`EFBMsgCommands`] -- Commands attached to the message
tr_tr: İsteğe bağlı [:obj:`EFBMsgCommands`] -- İletiye eklenmiş komutlar

source: :obj:`.EFBChannel` -- The channel that the message is to be delivered to
tr_tr: :obj:`.EFBChannel` -- Mesajın teslim edileceği kanal

source: *bool* -- Flag this up if the message is edited.
tr_tr: *bool* -- Eğer mesaj düzenlenir ise bunu işaretleyin.

source: *str* -- File name of the multimedia file. ``None`` if N/A
tr_tr: *str* -- Multimedya dosyasının dosya ismi. ``None`` eğer yoksa

source: *bool* -- Mark as true if this message is a system message.
tr_tr: *bool* -- Eğer bu mesaj bir sistem mesajıysa bunu doğru olarak işaretleyin.

source: *str* -- MIME type of the file. ``None`` if N/A
tr_tr: *str* -- Dosyanın MIME tipi. ``None`` eğer yoksa

source: *str* -- Local path of multimedia file. ``None`` if N/A
tr_tr: * str * -- Multimedya dosyasının yerel yolu. `` None`` eğer o değilse

source: Optional[:obj:`EFBMsgSubstitutions`] -- Substitutions of messages, usually used when the some parts of the text of the message refers to another user or chat.
tr_tr: İsteğe bağlı [:obj:`EFBMsgSubstitutions`] -- İletilerin metnin bazı bölümleri başka bir kullanıcıya veya sohbete atıfta bulunulduğunda kullanılan iletilerin değiştirilmesidir.

source: Optional[:obj:`EFBMsg`] -- Target message (usually for messages that "replies to" another message).
tr_tr: Optional[:obj:`EFBMsg`] -- Hedef mesaj (genellikle bir başka mesaja "cevap veren" mesajlar için).

source: This message may be a "minimum message", with only required fields:
tr_tr: Bu mesaj, sadece gereken alanlar ile birlikte "minimum mesaj" olabilir:

source: *str* -- text of the message
tr_tr: *str* -- mesaj metni

source: :obj:`.MsgType` -- Type of message
tr_tr: :obj:`.MsgType` -- Mesaj tipi

source: *str* -- Unique ID of message. Usually stores the message ID from slave channel. This ID must be unique among all chats in the same channel.
tr_tr: *str* -- Mesajın kendine mahsus kimliği. Genellikle bağımlı kanaldan mesaj kimliği depolar. Bu kimlik aynı kanaldaki tüm sohbetler arasında tek olmalıdır.

source: Some channels may not support message editing. Some channels may issue a new uid for edited message.
tr_tr: Bazı kanallar mesaj düzenlemeyi desteklemiyor olabilir. Bazı kanallar düzenlenmiş mesaj için yeni uid çıkarabilir.

source: *Dict[str, Any]* -- A series of vendor specific attributes attached. This can be used by any other channels or middlewares that is compatible with such information. Note that no guarantee is provided for information in this section.
tr_tr: *Dict[str, Any]* -- Bir dizi satıcıya özgü nitelik ekli. Bu, bu tür bilgilerle uyumlu olan diğer kanallar veya orta dosyalar tarafından kullanılabilir. Bu bölümdeki bilgiler için hiçbir garanti verilmemektedir.

source: Verify the validity of message.
tr_tr: Mesajın geçerliliğini doğrulayın.

source: *str* -- Human-friendly name of the command.
tr_tr: *str* -- Komutun insan-canlısı adı.

source: *str* -- Callable name of the command.
tr_tr: *str* -- Komutun çağrılabilir adı.

source: *List[Any]* -- Arguments passed to the function.
tr_tr: *List[Any]* -- İşleve geçirilen bağımsız değişkenler.

source: *Dict[str, Any]* -- Keyword arguments passed to the function.
tr_tr: *Dict[str, Any]* -- İşleve geçirilen anahtar kelime bağımsız değişkenleri.

source: Parameters
tr_tr: Değiştirgeler

source: Human-friendly name of the command.
tr_tr: Komutun dost canlısı adı.

source: Callable name of the command.
tr_tr: Komutun çağrılabilir adı.

source: Arguments passed to the function. Defaulted to empty list;
tr_tr: İşleve geçen bağımsız değişken. Varsayılan olarak boş liste;

source: Keyword arguments passed to the function. Defaulted to empty dict.
tr_tr: Fonksiyona geçen anahtar kelimeler. Boş sözlük için varsayılan.

source: EFB message commands. Message commands allow user to take action to a specific message, including vote, add friends, etc.
tr_tr: EFB mesaj komutları. Mesaj komutları kullanıcının spesifik bir mesajla harekete geçmesine izin verir, oy vermeyi, arkadaş eklemeyi ve benzerlerini içerir.

source: list of :obj:`EFBMsgCommand` -- Commands for the message.
tr_tr: list of :obj:`EFBMsgCommand`-- Mesaj için komutlar.

source: Commands for the message.
tr_tr: Mesaj için komutlar.

source: EFB link message attribute.
tr_tr: EFB bağlantı mesajı özniteliği.

source: *str* -- Title of the link.
tr_tr: *str* -- Bağlantının başlığı.

source: *str, optional* -- Description of the link.
tr_tr: *str, optional* -- Bağlantının tanımı.

source: *str, optional* -- Image/thumbnail URL of the link.
tr_tr: *str, optional* -- Bağlantıya ait resim/küçük resim URL'si.

source: *str* -- URL of the link.
tr_tr: *str* -- Bağlantı URL'si.

source: Title of the link.
tr_tr: Bağlantının başlığı.

source: Description of the link.
tr_tr: Bağlantının açıklaması.

source: Image/thumbnail URL of the link.
tr_tr: Bağlantıya ait resim/küçük resim URL'si.

source: URL of the link.
tr_tr: Bağlantının URL'si.

source: EFB location message attribute.
tr_tr: EFB konum mesajı özniteliği.

source: *float* -- Latitude of the location.
tr_tr: *float* -- Konumun enlemi.

source: *float* -- Longitude of the location.
tr_tr: *float* -- Konumun boylamı.

source: Latitude of the location.
tr_tr: Konumun enlemi.

source: Longitude of the location.
tr_tr: Konumun boylamı.

source: EFB Message status attribute. Message with type ``Status`` notifies the other end to update a chat-specific status, such as typing, send files, etc.
tr_tr: EFB Mesaj durumu özelliği. ``Status`` türünde mesaj, yazma, dosya gönderme vb. gibi sohbete özgü durum güncellemesini diğer tarafa bildirir.

source: Type of status, possible values are defined in the ``EFBMsgStatusAttribute``.
tr_tr: Durum türü, olası değerler ``EFBMsgStatusAttribute`` içinde tanımlanır.

source: *Optional[int]* -- Number of milliseconds for this status to expire. Default to 5 seconds.
tr_tr: *Optional[int]* -- Bu durumun bitmesi için milisaniye süresi. Varsayılan olarak 5 saniyedir.

source: List of status types supported
tr_tr: Desteklenen durum türlerinin listesi

source: Bases: :class:`enum.Enum`
tr_tr: Düzlemler: :class:`sırala.Sırala`

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of typing.
tr_tr: Kullanılan :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, yazma durumunu gösterir.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading file.
tr_tr: Kullanılan :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, dosya yükleme durumunu gösterir.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading image.
tr_tr: Kullanılan :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, görüntü yükleme durumunu gösterir.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading audio.
tr_tr: Kullanılan :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, ses yükleme durumunu gösterir.

source: Used in :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, represent the status of uploading video.
tr_tr: Kullanılan :attr:`~.ehforwarderbot.message.EFBMsgStatusAttribute.status_type`, video yükleme durumunu gösterir.

source: Type of status.
tr_tr: Durumun türü.

source: Number of milliseconds for this status to expire. Default to 5 seconds.
tr_tr: Bu durumun bitmesi için milisaniye süresi. Varsayılan olarak 5 saniyedir.

source: Bases: :class:`dict`
tr_tr: Temel: :class:`dict`

source: EFB message substitutions.
tr_tr: EFB mesaj değiştirme.

source: Dictionary of text substitutions targeting to a user or member.
tr_tr: Bir kullanıcı veya üyeye yönelik metin değiştirme sözlüğü.

source: Value of the dict may be any user of the chat, or a member of a group. Notice that the :obj:`EFBChat` object here must NOT be a group.
tr_tr: Sözlüğün değeri, sohbetin herhangi bir kullanıcısı veya bir grubun üyesi olabilir.Buradaki :obj:`EFBChat` nesnesinin bir grup olmamasına dikkat edin.

source: Type:
tr_tr: Tür:

source: Examples
tr_tr: Örnekler

source: Initialization and marking chats
tr_tr: Başlatma ve işaretleme sohbetleri

source: Marking message references (targeted message)
tr_tr: Mesaj referanslarını işaretleme (hedeflenmiş mesaj)

source: Edit a previously sent message
tr_tr: Önceden gönderilmiş mesajı düzenle

source: Type-specific Information
tr_tr: Türe özgü bilgi

source: Text message
tr_tr: Metin mesajı

source: Media message
tr_tr: Medya mesajı

source: Information related to media processing is described in :doc:`/guide/media_processing`.
tr_tr: Medya işleme ile ilgili bilgiler: doc:`/guide/media_processing` bölümünde açıklanmıştır.

source: The example below is for image (picture) messages. Audio, file, video, sticker works in the same way.
tr_tr: Aşağıdaki örnek resim(fotoğraf) mesajlar içindir. Ses, dosya, video, etiket aynı şekilde çalışır.

source: In non-text messages, the ``text`` attribute is optional.
tr_tr: Metin olmayan mesajlarda, `` text`` özelliği isteğe bağlıdır.

source: Location message
tr_tr: Konum mesajı

source: Link message
tr_tr: Bağlantı mesajı

source: Status
tr_tr: Durum

source: Unsupported message
tr_tr: Desteklenmeyen mesaj

source: ``text`` attribute is required for this type of message.
tr_tr: Bu tür bir mesaj için `` text`` özelliği gereklidir.

source: Additional information
tr_tr: Ek bilgi

source: Substitution
tr_tr: Değişim

source: Commands
tr_tr: Komutlar
