Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/API/middleware.po
Languages: id_id, tr_tr

source: Middleware class.
id_id: Kelas Middleware.
tr_tr: Aracı yazılım sınıfı.

source: *str* -- Human-readable name of the middleware.
id_id: * str * - Nama middleware yang dapat dibaca manusia.
tr_tr: *str* -- İnsan tarafından okunabilen özel yazılımının adı.

source: *str* -- The instance ID if available.
id_id: *str* -- ID instan jika tersedia.
tr_tr: * str * -- Varsa, Kimliğin örneği.

source: Initialize the middleware. Inherited initializer must call the "super init" method at the beginning.
id_id: Menginisialisasi peranti tengah. Mewarisi penginisialisasi harus memanggil "super init" metode di awal.
tr_tr: Ara yazılımını başlat. Devralınan başlatıcı başlangıçta "süper init" yöntemini çağırmalıdır.

source: Parameters
id_id: Parameter
tr_tr: Parametreler

source: Instance ID of the channel.
tr_tr: Kanalın örnek kimliğidir.

source: Process a message with middleware
id_id: Proses pesan dengan middleware
tr_tr: Özel yazılım ile mesaj işle

source: Message object to process
id_id: Objek pesan untuk diproses
tr_tr: İşlenecek mesaj nesnesi

source: Returns
id_id: Kembali
tr_tr: Dönüşler

source: Processed message or None if discarded.
id_id: Pesan yang diproses atau Tidak ada jika dibuang.
tr_tr: İşlenmiş mesaj veya atıldıysa Hiçbiri.

source: Return type
id_id: Tipe pengembalian
tr_tr: Dönüş türü

source: Process a status update with middleware
id_id: Proses memperbarui status dengan middleware
tr_tr: Özel yazılım ile durum güncellemesi işle

source: Processed status or None if discarded.
id_id: Status yang diproses atau Tidak ada jika dibuang.
tr_tr: İşlenmiş durum veya atıldıysa Hiçbiri.

source: About Middleware ID
id_id: Tentang Middleware ID
tr_tr: Middleware Kimliği Hakkında

source: With the introduction of instance IDs, it is required to use the ``self.middleware_id`` or equivalent instead of any hard-coded ID or constants while referring to the middleware (e.g. while retrieving the path to the configuration files, etc).
id_id: Dengan diperkenalkannya ID instan, diperlukan untuk menggunakan ``self.middleware_id`` atau setara dengan ID kode keras atau konstanta saat mengacu pada peranti tengah (misalnya saat mengambil path pada file konfigurasi, dll.).
tr_tr: Örnek kimliklerin sunulmasıyla, katman yazılımına atıfta bulunulurken (örn. Yapılandırma dosyalarına yol alırken vb.) Herhangi bir sabit kodlanmış kimlik veya sabitler yerine ``self.middleware_id`` veya eşdeğeri kullanılmalıdır.
