Repository: staniya/CYBEX
Catalog: cybeXtelegram/ehForwarderBot/docs/locale/*/LC_MESSAGES/API/status.po
Languages: id_id

source: Abstract class of a status
id_id: Kelas abstrak pada sebuah status

source: :obj:`.EFBChannel` -- The channel that this status is sent to, usually the master channel.
id_id: :obj:`.EFBChannel` -- Saluran status tersebut dikirim ke, biasanya saluran utama.

source: Inform the master channel on updates of slave chats.
id_id: Menginformasikan pada saluran utama tentang pembaruan obrolan slave.

source: :obj:`.EFBChannel` -- Slave channel that issues the update
id_id: :obj:`.EFBChannel` -- Saluran slave yang bermasalah dengan pembaruan

source: *Optional[Tuple[str]]* -- Unique ID of new chats
id_id: *Optional[Tuple[str]]* -- ID unik pada obrolan baru

source: *Optional[Tuple[str]]* -- Unique ID of removed chats
id_id: *Optional[Tuple[str]]* -- ID unik pada obrolan yang dihapus

source: *Optional[Tuple[str]]* -- Unique ID of modified chats
id_id: *Optional[Tuple[str]]* -- ID unik pada obrolan yang diubah

source: Slave channel that issues the update
id_id: Saluran slave bermasalah dengan pembaruan

source: Unique ID of new chats
id_id: ID unik dari obrolan baru

source: Unique ID of removed chats
id_id: ID unik dari obrolan yang dihapus

source: Unique ID of modified chats
id_id: ID unik pada obrolan yang diubah

source: Inform the master channel on updates of members in a slave chat.
id_id: Memberitahukan saluran utama pada pembaruan anggota dalam sebuah obrolan budak.

source: *str* -- Unique ID of the chat.
id_id: str* -- ID unik dari obrolan.

source: *Optional[Tuple[str]]* -- Unique ID of new members
id_id: *Optional[Tuple[str]]* -- ID unik anggota baru

source: *Optional[Tuple[str]]* -- Unique ID of removed members
id_id: *Optional[Tuple[str]]* -- ID unik anggota yang dihapus

source: Unique ID of the chat.
id_id: ID unik obrolan.

source: Unique ID of new members
id_id: ID unik dari anggota baru

source: Unique ID of removed members
id_id: ID unik dari anggota yang dihapus

source: Inform a channel to remove a certain message.
id_id: Memberitahukan sebuah saluran untuk menghapus sebuah pesan tertentu.

source: This is usually known as "delete from everyone", "delete from recipient", "recall a message", or "revoke a message" as well, depends on the IM.
id_id: Ini biasanya dikenal sebagai "hapus dari semua orang", "hapus dari penerima", "tarik sebuah pesan", atau "cabut sebuah pesan" juga, tergantung pada IM.

source: Some channels may not support removal of messages, and raises a :obj:`.exceptions.EFBOperationNotSupported` exception.
id_id: Beberapa saluran mungkin tidak mendukung penghapusan pesan, dan menimbulkan sebuah :obj:`.exceptions.EFBOperationNotSupported` pengecualian.

source: :obj:`.EFBChannel` -- Channel issued the status
id_id: :obj:`.EFBChannel` -- Saluran mengeluarkan status

source: :obj:`.EFBMsg` -- Message to remove. This may not be a complete :obj:`.EFBMsg` object.
id_id: :obj:`.EFBMsg` -- Pesan untuk dihapus. Ini mungkin bukan obyek yang lengkap :obj:`.EFBMsg`.

source: Create a message removal status
id_id: Buat pesan penghapusan status

source: Try to provided as much as you can, if not, provide a minimum information in the channel:
id_id: Cobalah untuk menyediakan sebanyak yang anda bisa, jika tidak, sediakan informasi minimum pada saluran:

source: Slave channel ID and chat ID (:attr:`message.chat.channel_id <.EFBChat.channel_id>` and :attr:`message.chat.chat_uid <.EFBChat.chat_uid>`)
id_id: ID Saluran slave dan ID obrolan (:attr:`message.chat.channel_id <.EFBChat.channel_id>` and :attr:`message.chat.chat_uid <.EFBChat.chat_uid>`)

source: Message unique ID from the slave channel (:attr:`message.uid <.EFBMsg.uid>`)
id_id: Pesan ID unik dari saluran slave (:attr:`message.uid <.EFBMsg.uid>`)

source: Channel the status is issued to
id_id: Status saluran dikeluarkan untuk

source: Message to remove.
id_id: Menghapus untuk pesan.
